org/q_and_a.org
# #+include: info/common-header.org
#+OPTIONS:   H:6 toc:nil num:nil　
#+OPTIONS: ^:{}
#+PROPERTY:  header-args :padline no
#+title: 微分ゼミ
#+author: suzuki@iwate-u.ac.jp

#+title: 3回目の質問

#+OPTIONS: tex:t \n:nil latex:t
#+BEGIN_SRC elisp :exports none
(setq org-startup-with-inline-images t)
#+END_SRC

** 前回までのまとめや手書き資料

- 平均値の定理，理解していない

  3~4回目の内容に，平均値の定理の意味が書いてあります

- \(\Delta_2\) の極限は，\(Q \leftarrow R \)だけ考えているのに，
  なぜ \(P\) が関係するのかわからない

  全体では，\(P \leftarrow R \)を考えているからです。

- 偏微分がわからない

  - \(f(x,y)\) の変化量の極限を *全微分* と呼び，

  - x-方向とy-方向のそれぞれの変化量の和になる

    - x-方向の変化量は，\(f_x(x,y) dx\)

      - \(f_x(x,y)\) を\(x\)に関する偏微分と呼び，

      - y を定数と考え，x だけで微分することとする

- テイラーがわからない

  きっと4回目でわかると思います。

- 全微分がわからない

  - 関数の変化量の極限のこと

    - 1変数なら， \(dy = f'(x) dx\)

    - 2変数なら， \(dz = f_x(x,y)dx + f_y(x,y)dy\)

- テイラーの応用がわからない

  - 計算できない，しにくい関数の関数値を計算する公式が作れる

  - その公式は，精度が高ければ，関数自身(の近似)とみなせる

- arcsin がわからない

  - sin関数をよく知っているとして，

  - \(y = arcsin(x)\) は，\(sin(y)=x\) という関係を満すyとxの関係

    - sin の値を与えて，角を求める関数

    - (斜辺の長さが1の) 直角三角形の高さから，角を求める関数

- \(c = a+\theta\,h\)と書き換える意味は？

  - \([a, f(a)]\) から hだけ離れた点 \([a+h, f(a+h)]\)を求めたい

  - 区間 a~a+h の途中に平均変化を接線の傾きとする点\(a+\theta\,h\)があ
    る

  - 後で，a を定点，hはaからの距離を表わす変数と見る

- 近似がわからない

  近似 - Wikipedia
  https://ja.wikipedia.org/wiki/%E8%BF%91%E4%BC%BC


  以下は，説明のために，僕が勝手につくった言葉や概念です:

  - 点での近似 :: 計算した値どうしが近い値になる

  - 関数としての近似 :: すべての点で，点での近似になっている

  - ある区間での関数としての近似 :: 同一区間内のすべての点で，点での近
       似になっている

  [[https://ja.wikipedia.org/wiki/%E5%86%AA%E7%B4%9A%E6%95%B0][冪級数 - Wikipedia]] の近似

  - 途中で打ち切ったときの誤差

  - 収束するのか







