docs/q_and_a.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"https://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="https://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>微分ゼミ 3回目の質問</title>
<!-- 2017-11-09 Thu 12:04 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="suzuki@iwate-u.ac.jp" />
</head>
<body>
<div id="content">
<h1 class="title">微分ゼミ 3回目の質問</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 前回までのまとめや手書き資料</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>平均値の定理，理解していない

<p>
3~4回目の内容に，平均値の定理の意味が書いてあります
</p>
</li>

<li>\(\Delta_2\) の極限は，\(Q \leftarrow R \)だけ考えているのに，
なぜ \(P\) が関係するのかわからない

<p>
全体では，\(P \leftarrow R \)を考えているからです。
</p>
</li>

<li>偏微分がわからない

<ul class="org-ul">
<li>\(f(x,y)\) の変化量の極限を <b>全微分</b> と呼び，
</li>

<li>x-方向とy-方向のそれぞれの変化量の和になる

<ul class="org-ul">
<li>x-方向の変化量は，\(f_x(x,y) dx\)

<ul class="org-ul">
<li>\(f_x(x,y)\) を\(x\)に関する偏微分と呼び，
</li>

<li>y を定数と考え，x だけで微分することとする
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>

<li>テイラーがわからない

<p>
きっと4回目でわかると思います。
</p>
</li>

<li>全微分がわからない

<ul class="org-ul">
<li>関数の変化量の極限のこと

<ul class="org-ul">
<li>1変数なら， \(dy = f'(x) dx\)
</li>

<li>2変数なら， \(dz = f_x(x,y)dx + f_y(x,y)dy\)
</li>
</ul>
</li>
</ul>
</li>

<li>テイラーの応用がわからない

<ul class="org-ul">
<li>計算できない，しにくい関数の関数値を計算する公式が作れる
</li>

<li>その公式は，精度が高ければ，関数自身(の近似)とみなせる
</li>
</ul>
</li>

<li>arcsin がわからない

<ul class="org-ul">
<li>sin関数をよく知っているとして，
</li>

<li>\(y = arcsin(x)\) は，\(sin(y)=x\) という関係を満すyとxの関係

<ul class="org-ul">
<li>sin の値を与えて，角を求める関数
</li>

<li>(斜辺の長さが1の) 直角三角形の高さから，角を求める関数
</li>
</ul>
</li>
</ul>
</li>

<li>\(c = a+\theta\,h\)と書き換える意味は？

<ul class="org-ul">
<li>\([a, f(a)]\) から hだけ離れた点 \([a+h, f(a+h)]\)を求めたい
</li>

<li>区間 a~a+h の途中に平均変化を接線の傾きとする点\(a+\theta\,h\)があ
る
</li>

<li>後で，a を定点，hはaからの距離を表わす変数と見る
</li>
</ul>
</li>

<li>近似がわからない

<p>
近似 - Wikipedia
<a href="https://ja.wikipedia.org/wiki/%E8%BF%91%E4%BC%BC">https://ja.wikipedia.org/wiki/%E8%BF%91%E4%BC%BC</a>
</p>
</li>
</ul>


<p>
以下は，説明のために，僕が勝手につくった言葉や概念です:
</p>

<dl class="org-dl">
<dt> 点での近似 </dt><dd>計算した値どうしが近い値になる
</dd>

<dt> 関数としての近似 </dt><dd>すべての点で，点での近似になっている
</dd>

<dt> ある区間での関数としての近似 </dt><dd>同一区間内のすべての点で，点での近
似になっている
</dd>
</dl>

<p>
<a href="https://ja.wikipedia.org/wiki/%E5%86%AA%E7%B4%9A%E6%95%B0">冪級数 - Wikipedia</a> の近似
</p>

<ul class="org-ul">
<li>途中で打ち切ったときの誤差
</li>

<li>収束するのか
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: suzuki@iwate-u.ac.jp</p>
<p class="date">Created: 2017-11-09 Thu 12:04</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="https://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
